package kz.book.eater;

import java.util.Arrays;
import java.util.List;

public class Genres {
    private static final List<String> GENRES = java.util.List.of(
            "Фэнтези",
            "Научная Фантастика",
            "Нон-фикшн",
            "Детектив",
            "Романтика",
            "Ужасы",
            "Триллер",
            "Приключения",
            "Исторический роман",
            "Научно-популярная литература",
            "Боевик",
            "Биография",
            "Поэзия",
            "Драма",
            "Мистика",
            "Эпос",
            "Автобиография",
            "Юмор",
            "Киберпанк",
            "Постапокалипсис",
            "Детская литература",
            "Молодёжная проза",
            "Психология",
            "Философия",
            "Финансы домашнего хозяйства",
            "Эротика",
            "Кулинария",
            "Путеводители",
            "Религия",
            "Эссе",
            "ЛитРПГ",
            "Классика",
            "Сказки",
            "Саморазвитие",
            "Техническая литература",
            "Учебники",
            "Антиутопия",
            "Готический роман",
            "Шпионский роман",
            "Чиклит",
            "Семейная сага",
            "Христианская литература"
    );
    public static List<String> getGenres() {
        return GENRES;
    }
    public static String getGenre(int index) {
        return GENRES.get(index);
    }
}
